documents/images/graphio/stdlib/extract_color4.dot
digraph {
  rankdir = LR;
    NG_extract_color4_N_sw_color4 [label= "switch"];
    NG_extract_color4_N_sw_color4[shape = diamond];
    NG_extract_color4_N_sw_color4 ->     NG_extract_color4_out;
    NG_extract_color4_out [label= "out"];
    NG_extract_color4_out[shape = box]; 
    NG_extract_color4_indexINT [label="index"];
    NG_extract_color4_indexINT [shape = ellipse];
    NG_extract_color4_N_sw_color4 [label="switch"];
    NG_extract_color4_indexINT -> NG_extract_color4_N_sw_color4 [label=".which"];
    NG_extract_color4_N_r_color4 [label= "swizzle"];
    NG_extract_color4_N_r_color4[shape = box];
    NG_extract_color4_N_r_color4 ->     NG_extract_color4_N_sw_color4 [label= "in1"];
    NG_extract_color4_N_sw_color4 [label= "switch"];
    NG_extract_color4_N_sw_color4[shape = diamond]; 
    NG_extract_color4_inINT [label="in"];
    NG_extract_color4_inINT [shape = ellipse];
    NG_extract_color4_N_r_color4 [label="swizzle"];
    NG_extract_color4_inINT -> NG_extract_color4_N_r_color4 [label=".in"];
    NG_extract_color4_N_g_color4 [label= "swizzle"];
    NG_extract_color4_N_g_color4[shape = box];
    NG_extract_color4_N_g_color4 ->     NG_extract_color4_N_sw_color4 [label= "in2"];
    NG_extract_color4_N_sw_color4 [label= "switch"];
    NG_extract_color4_N_sw_color4[shape = diamond]; 
    NG_extract_color4_inINT [label="in"];
    NG_extract_color4_inINT [shape = ellipse];
    NG_extract_color4_N_g_color4 [label="swizzle"];
    NG_extract_color4_inINT -> NG_extract_color4_N_g_color4 [label=".in"];
    NG_extract_color4_N_b_color4 [label= "swizzle"];
    NG_extract_color4_N_b_color4[shape = box];
    NG_extract_color4_N_b_color4 ->     NG_extract_color4_N_sw_color4 [label= "in3"];
    NG_extract_color4_N_sw_color4 [label= "switch"];
    NG_extract_color4_N_sw_color4[shape = diamond]; 
    NG_extract_color4_inINT [label="in"];
    NG_extract_color4_inINT [shape = ellipse];
    NG_extract_color4_N_b_color4 [label="swizzle"];
    NG_extract_color4_inINT -> NG_extract_color4_N_b_color4 [label=".in"];
    NG_extract_color4_N_a_color4 [label= "swizzle"];
    NG_extract_color4_N_a_color4[shape = box];
    NG_extract_color4_N_a_color4 ->     NG_extract_color4_N_sw_color4 [label= "in4"];
    NG_extract_color4_N_sw_color4 [label= "switch"];
    NG_extract_color4_N_sw_color4[shape = diamond]; 
    NG_extract_color4_inINT [label="in"];
    NG_extract_color4_inINT [shape = ellipse];
    NG_extract_color4_N_a_color4 [label="swizzle"];
    NG_extract_color4_inINT -> NG_extract_color4_N_a_color4 [label=".in"];
}
